# Задание 1

var_int = 10
var_float = 8.4
var_str = "No"

# Задание 2

big_int = 3.5 * var_int  # только тут float уже получится (идентификатор переменной немного не подходит)

# Задание 3

var_float -= 1

# Задание 4

print("var_int / var_float =", var_int / var_float)
print("big_int / var_float =", big_int / var_float)

# Задание 5

var_str = var_str * 2 + "Yes" * 3

# Задание 6

print("Значение переменной var_int -", var_int)
print("Значение переменной var_float -", var_float)
print("Значение переменной big_int -", big_int)
print("Значение переменной var_str -", var_str)

